<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest verison of Zotero for Windows</string>
	<key>Identifier</key>
	<string>com.github.hansen-m.download.zotero-win</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Zotero</string>
		<key>SEARCH_URL</key>
		<string>https://www.zotero.org/download/</string>
		<key>DOWNLOAD_URL</key>
		<string>https://download.zotero.org/client/release/</string>
		<key>VERSION_SEARCH_PATTERN</key>
		<string>"win32":"(?P&lt;version&gt;[0-9.]+)"</string>
		<!--5.0.7/Zotero-5.0.7_setup.exe-->
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%VERSION_SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
        	<key>Processor</key>
        	<string>URLDownloader</string>
        	<key>Arguments</key>
        	<dict>
        		<key>url</key>
        		<string>%DOWNLOAD_URL%%version%/Zotero-%version%_setup.exe</string>
        		<key>filename</key>
        		<string>%NAME%.exe</string>
        	</dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
